fonecmid-diplom/src/Documents/ВКМ_ВыплатыЗарплаты/ВКМ_ВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатыЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>ВКМ_Выплаты</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатыЗарплаты/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ВКМ_ВыплатыВКМ_СотрудникПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ВКМ_Выплаты.ТекущиеДанные;
	
	СуммаКВыплате = ОпределитьСуммуВыплаты(СтрокаТЧ.ВКМ_Сотрудник);
	
	Если Не ЗначениеЗаполнено(СуммаКВыплате) Тогда
	
		СтрокаТЧ.ВКМ_Сумма = 0;	
		
	Иначе
						
		СтрокаТЧ.ВКМ_Сумма = СуммаКВыплате;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ОпределитьСуммуВыплаты(Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, ВКМ_Сотрудник = &Сотрудник) КАК
	|		ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Период", КонецДня(Объект.Дата) );
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник );
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СуммаОстаток = 0;
	
	Пока Выборка.Следующий() Цикл
		
		СуммаОстаток = СуммаОстаток + Выборка.СуммаОстаток;
		
	КонецЦикла;
	
	Возврат СуммаОстаток;
	
КонецФункции
